demo/TIL/concurrency-lab/jmeter/results/report-idea1-run2-backup/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 197,
    "errorPct" : 98.5,
    "meanResTime" : 31.10500000000001,
    "medianResTime" : 10.0,
    "minResTime" : 5.0,
    "maxResTime" : 131.0,
    "pct1ResTime" : 114.9,
    "pct2ResTime" : 121.94999999999999,
    "pct3ResTime" : 129.99,
    "throughput" : 233.91812865497076,
    "receivedKBytesPerSec" : 58.874725877192986,
    "sentKBytesPerSec" : 48.533442982456144
  },
  "POST /api/enroll" : {
    "transaction" : "POST /api/enroll",
    "sampleCount" : 200,
    "errorCount" : 197,
    "errorPct" : 98.5,
    "meanResTime" : 31.10500000000001,
    "medianResTime" : 10.0,
    "minResTime" : 5.0,
    "maxResTime" : 131.0,
    "pct1ResTime" : 114.9,
    "pct2ResTime" : 121.94999999999999,
    "pct3ResTime" : 129.99,
    "throughput" : 233.91812865497076,
    "receivedKBytesPerSec" : 58.874725877192986,
    "sentKBytesPerSec" : 48.533442982456144
  }
}