demo/TIL/concurrency-lab/jmeter/results/report-idea1-run3/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 200,
    "errorCount" : 197,
    "errorPct" : 98.5,
    "meanResTime" : 20.285,
    "medianResTime" : 7.0,
    "minResTime" : 5.0,
    "maxResTime" : 92.0,
    "pct1ResTime" : 79.80000000000001,
    "pct2ResTime" : 85.94999999999999,
    "pct3ResTime" : 91.98000000000002,
    "throughput" : 236.68639053254438,
    "receivedKBytesPerSec" : 59.57146819526628,
    "sentKBytesPerSec" : 49.10780325443787
  },
  "POST /api/enroll" : {
    "transaction" : "POST /api/enroll",
    "sampleCount" : 200,
    "errorCount" : 197,
    "errorPct" : 98.5,
    "meanResTime" : 20.285,
    "medianResTime" : 7.0,
    "minResTime" : 5.0,
    "maxResTime" : 92.0,
    "pct1ResTime" : 79.80000000000001,
    "pct2ResTime" : 85.94999999999999,
    "pct3ResTime" : 91.98000000000002,
    "throughput" : 236.68639053254438,
    "receivedKBytesPerSec" : 59.57146819526628,
    "sentKBytesPerSec" : 49.10780325443787
  }
}